package lesson2;

public class HW11 {
    //6. Составьте программу, выводящую на экран квадраты чисел от 10 до
    //20 включительно.

    public static void squareOfNumbers() {
        int a = 0;
        for (int i = 10; i <= 20; i++) {
            a = i * i;
            System.out.println(a);
        }
    }
}
